Brannflakess/CMPE_146_Project/STM32/Core/Src/main.c
#include "main.h"
/* USER CODE BEGIN Includes */
#include <string.h>
#include <stdio.h>
#include <stdlib.h>
#include <stdint.h>
#include "oled_ssd1306.h"
/* Ensure device/CMSIS headers are available via project include paths */
#include "stm32f4xx.h"
#include "stm32f401xe.h"
#include "stm32f4xx_hal_flash_ex.h"

/* Fallback for IntelliSense: define FLASH_LATENCY_0 if HAL headers were not processed */
#ifndef FLASH_LATENCY_0
#define FLASH_LATENCY_0 0
#endif
/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
I2C_HandleTypeDef hi2c1;
UART_HandleTypeDef huart1;
UART_HandleTypeDef huart2;

/* USER CODE BEGIN PV */
/* MPU-6050 definitions ------------------------------------------------------*/
#define MPU6050_ADDR (0x68 << 1)
#define MPU6050_REG_WHO_AM_I 0x75
#define MPU6050_REG_PWR_MGMT_1 0x6B
#define MPU6050_REG_ACCEL_XOUT_H 0x3B

/* General settings ----------------------------------------------------------*/
#define FILTER_SIZE 5
#define SAMPLE_DELAY_MS 80
#define MODE_LOCK_MS 600
#define ESP32_TX_PERIOD_MS 100

/* -------------------------------------------------------------------------- */
/* EXERCISE MODE DETECTION                                                    */
/* -------------------------------------------------------------------------- */
/*
 * Chest-mounted board: during real motion, |AY| and |AZ| are often BOTH large.
 * Use *dominant axis* (larger |accel| wins by margin) once total tilt is strong enough.
 */
#define MODE_GRAVITY_HIGH 9500       /* min(|AY|,|AZ|) max — "enough tilt" to pick squat vs push-up */
#define MODE_AXIS_DOMINANCE_MARGIN 800 /* dominant axis must exceed the other by this (raw units) */

typedef enum
{
    EXERCISE_UNKNOWN = 0,
    EXERCISE_SQUAT,
    EXERCISE_PUSHUP
} ExerciseMode;

/* -------------------------------------------------------------------------- */
/* SQUAT SETTINGS                                                             */
/* -------------------------------------------------------------------------- */
#define SQUAT_REP_LOCKOUT_MS 1000
#define SQUAT_STAND_THRESHOLD 15000
#define SQUAT_DOWN_THRESHOLD 13800
#define SQUAT_BOTTOM_THRESHOLD 12800
#define SQUAT_UP_THRESHOLD 13800

/* Range/delta-based thresholds (filtered AY). Lower = easier partial squats. */
#define SQUAT_DOWN_DELTA 900       /* start descent with less drop from baseline */
#define SQUAT_BOTTOM_DELTA 1500    /* register bottom with less depth */
#define SQUAT_MIN_ROM 650          /* count smaller ROM reps */
#define MIN_STATE_HOLD 2
/* GOING_DOWN: abort only when nearly upright again (lower = fewer false aborts) */
#define SQUAT_DOWN_ABORT_DELTA 280
/* Leaving BOTTOM: fraction of BOTTOM_DELTA (higher = easier / shallower squat) */
#define SQUAT_LEAVE_BOTTOM_MULT 0.72f
/* GOING_UP -> STANDING: fraction of DOWN_DELTA (higher = finish rep before fully upright) */
#define SQUAT_STANDING_DONE_MULT 0.82f

typedef enum
{
    SQUAT_STATE_STANDING = 0,
    SQUAT_STATE_GOING_DOWN,
    SQUAT_STATE_BOTTOM,
    SQUAT_STATE_GOING_UP
} SquatState;

/* -------------------------------------------------------------------------- */
/* PUSH-UP SETTINGS                                                           */
/* -------------------------------------------------------------------------- */
#define PUSHUP_REP_LOCKOUT_MS 500

/*
 * Filtered AZ (raw units). "Going down" = less negative; BOTTOM needs value > BOTTOM_THRESHOLD.
 * If BOTTOM is too close to 0 (e.g. -9800) but your filtered trace only reaches ~-11k, BOTTOM never triggers.
 *
 * TOP_ABORT: while lowering — very negative = cancel rep.
 * TOP_COMPLETE: while pressing up — shallow lock-out still counts.
 */
#define PUSHUP_TOP_ABORT_THRESHOLD -20600
#define PUSHUP_TOP_COMPLETE_THRESHOLD -13600
#define PUSHUP_DOWN_THRESHOLD -13200
#define PUSHUP_BOTTOM_THRESHOLD -13600
#define PUSHUP_UP_THRESHOLD -10200

typedef enum
{
    PUSHUP_STATE_TOP = 0,
    PUSHUP_STATE_GOING_DOWN,
    PUSHUP_STATE_BOTTOM,
    PUSHUP_STATE_GOING_UP
} PushupState;

/* -------------------------------------------------------------------------- */
/* MOVING AVERAGE FILTER                                                      */
/* -------------------------------------------------------------------------- */
typedef struct
{
    int buffer[FILTER_SIZE];
    int index;
    int sum;
    uint8_t filled;
} MovingAverageFilter;

/* Global state --------------------------------------------------------------*/
static ExerciseMode current_mode = EXERCISE_UNKNOWN;
static ExerciseMode candidate_mode = EXERCISE_UNKNOWN;
static uint32_t candidate_mode_start = 0;

static SquatState squat_state = SQUAT_STATE_STANDING;
static uint32_t squat_count = 0;
static uint32_t squat_last_rep_time = 0;
static float squat_baseline_ay = 0.0f;
static uint8_t squat_baseline_init = 0;
static uint8_t squat_state_hold_count = 0;
static float squat_min_ay = 99999.0f;

static PushupState pushup_state = PUSHUP_STATE_TOP;
static uint32_t pushup_count = 0;
static uint32_t pushup_last_rep_time = 0;

static MovingAverageFilter squat_filter = {0};
static MovingAverageFilter pushup_filter = {0};

static uint32_t last_oled_update = 0;
static uint32_t last_esp32_tx = 0;

/* Monotonic per boot: new value after reset or power cycle (used as Firebase session key). */
static uint32_t g_session_id = 0;

/* I2C: consecutive MPU read failures before bus/controller recovery */
static uint8_t i2c_accel_fail_streak = 0;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
void OLED_UpdateScreen(void);
static void MX_GPIO_Init(void);
static void MX_I2C1_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_USART2_UART_Init(void);

/* USER CODE BEGIN PFP */
HAL_StatusTypeDef MPU6050_Init(void);
HAL_StatusTypeDef MPU6050_ReadAccelRaw(int16_t *ax, int16_t *ay, int16_t *az);

int MovingAverage_Update(MovingAverageFilter *f, int new_value);
void MovingAverage_Reset(MovingAverageFilter *f);

ExerciseMode Detect_ExerciseMode(int16_t ax, int16_t ay, int16_t az);
void Update_Mode_Lock(ExerciseMode detected_mode, uint32_t now_ms);

void Squat_Update(int value, uint32_t now_ms);
void Pushup_Update(int value, uint32_t now_ms);

