Brannflakess/CMPE_146_Project/STM32/Core/Src/main.c
const char *ExerciseMode_ToString(ExerciseMode mode);
const char *SquatState_ToString(SquatState state);
const char *PushupState_ToString(PushupState state);
HAL_StatusTypeDef UART1_SendString(const char *msg);
HAL_StatusTypeDef ESP32_SendTelemetry(int16_t ax,
                                      int16_t ay,
                                      int16_t az,
                                      int raw_axis,
                                      int filtered_axis,
                                      const char *state_string,
                                      uint32_t now_ms);
static void SessionId_InitAtBoot(void);
static void RecoverI2C1_AfterBusError(void);
/* USER CODE END PFP */

/* USER CODE BEGIN 0 */
/* Redirect printf to UART ---------------------------------------------------*/
int __io_putchar(int ch)
{
    HAL_UART_Transmit(&huart2, (uint8_t *)&ch, 1, HAL_MAX_DELAY);
    return ch;
}

HAL_StatusTypeDef UART1_SendString(const char *msg)
{
    size_t len = strlen(msg);
    if (len == 0U)
    {
        return HAL_OK;
    }
    return HAL_UART_Transmit(&huart1, (uint8_t *)msg, (uint16_t)len, 100);
}

static void RecoverI2C1_AfterBusError(void)
{
    (void)HAL_I2C_DeInit(&hi2c1);
    HAL_Delay(5);
    MX_I2C1_Init();
    printf("I2C1 bus recovery (DeInit + MX_I2C1_Init)\r\n");
}

static void SessionId_InitAtBoot(void)
{
    /* DWT cycle counter + SysTick vary each reset/power-on; HAL_GetTick() is often ~0 here
     * if called early — mixing avoids repeating the same session_id after unplug/replug. */
    CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;
    DWT->CYCCNT = 0U;
    DWT->CTRL |= DWT_CTRL_CYCCNTENA_Msk;

    uint32_t uid = HAL_GetUIDw0() ^ HAL_GetUIDw1() ^ HAL_GetUIDw2();
    uint32_t csr = RCC->CSR;
    uint32_t cy = DWT->CYCCNT;
    uint32_t tick = (uint32_t)HAL_GetTick();
    uint32_t systick = SysTick->VAL;

    g_session_id = uid ^ csr ^ cy ^ (tick * 0x9E3779B9u) ^ (systick << 17) ^ (systick >> 3);
    if (g_session_id == 0U)
    {
        g_session_id = 1U;
    }
    __HAL_RCC_CLEAR_RESET_FLAGS();
}

HAL_StatusTypeDef ESP32_SendTelemetry(int16_t ax,
                                      int16_t ay,
                                      int16_t az,
                                      int raw_axis,
                                      int filtered_axis,
                                      const char *state_string,
                                      uint32_t now_ms)
{
    char packet[512];
    int written = snprintf(packet,
                           sizeof(packet),
                           "{\"src\":\"stm32\",\"session_id\":%lu,\"t_ms\":%lu,\"mode\":\"%s\",\"state\":\"%s\",\"ax\":%d,\"ay\":%d,\"az\":%d,\"raw\":%d,\"filtered\":%d,\"squat_count\":%lu,\"pushup_count\":%lu,\"oled_mode\":\"%s\",\"oled_squats\":%lu,\"oled_pushups\":%lu}\r\n",
                           (unsigned long)g_session_id,
                           (unsigned long)now_ms,
                           ExerciseMode_ToString(current_mode),
                           state_string,
                           ax,
                           ay,
                           az,
                           raw_axis,
                           filtered_axis,
                           (unsigned long)squat_count,
                           (unsigned long)pushup_count,
                           ExerciseMode_ToString(current_mode),
                           (unsigned long)squat_count,
                           (unsigned long)pushup_count);

    if ((written <= 0) || (written >= (int)sizeof(packet)))
    {
        return HAL_ERROR;
    }

    return UART1_SendString(packet);
}

/* -------------------------------------------------------------------------- */
/* MPU INIT                                                                   */
/* -------------------------------------------------------------------------- */
HAL_StatusTypeDef MPU6050_Init(void)
{
    uint8_t who_am_i = 0;
    uint8_t wake_data = 0;
    HAL_StatusTypeDef status;

    printf("Starting MPU6050 squat + push-up counter...\r\n");

    status = HAL_I2C_Mem_Read(&hi2c1,
                              MPU6050_ADDR,
                              MPU6050_REG_WHO_AM_I,
                              I2C_MEMADD_SIZE_8BIT,
                              &who_am_i,
                              1,
                              100);

    if (status != HAL_OK)
    {
        printf("WHO_AM_I read failed\r\n");
        return status;
    }

    printf("WHO_AM_I = 0x%02X\r\n", who_am_i);

    if (who_am_i != 0x68)
    {
        printf("Unexpected WHO_AM_I value\r\n");
    }

    wake_data = 0;
    status = HAL_I2C_Mem_Write(&hi2c1,
                               MPU6050_ADDR,
                               MPU6050_REG_PWR_MGMT_1,
                               I2C_MEMADD_SIZE_8BIT,
                               &wake_data,
                               1,
                               100);

    if (status != HAL_OK)
    {
        printf("MPU6050 wake-up failed\r\n");
        return status;
    }

    printf("MPU6050 wake-up successful\r\n");
    HAL_Delay(100);

    return HAL_OK;
}

/* -------------------------------------------------------------------------- */
/* MPU READ                                                                   */
/* -------------------------------------------------------------------------- */
HAL_StatusTypeDef MPU6050_ReadAccelRaw(int16_t *ax, int16_t *ay, int16_t *az)
{
    uint8_t accel_data[6];
    HAL_StatusTypeDef status;

    status = HAL_I2C_Mem_Read(&hi2c1,
                              MPU6050_ADDR,
                              MPU6050_REG_ACCEL_XOUT_H,
                              I2C_MEMADD_SIZE_8BIT,
                              accel_data,
                              6,
                              100);

    if (status != HAL_OK)
    {
        return status;
    }

    *ax = (int16_t)((accel_data[0] << 8) | accel_data[1]);
    *ay = (int16_t)((accel_data[2] << 8) | accel_data[3]);
    *az = (int16_t)((accel_data[4] << 8) | accel_data[5]);

    return HAL_OK;
}

